In [84]:
import numpy as np
import pandas as pd

In [85]:
KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [86]:
df_KTX.loc['2011']  #.loc를 통하여 지정한 index의 값만 뽑아낼 수 있다. series형태

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [87]:
df_KTX.loc[['2011']]    #리스트를 씌워 데이터 프레임형태로 값을 뽑아낼 수 있다.

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN

In [88]:
df_KTX.loc['2013':'2016']   #구간을 지정해 연속된 구간의 행을 선택할 수 있다.

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

In [89]:
df_KTX['동해선 KTX']    #column 역시 출력이 가능하다.

2011       NaN
2012       NaN
2013       NaN
2014       NaN
2015    2395.0
2016    3786.0
2017    6667.0
Name: 동해선 KTX, dtype: float64

In [90]:
df_KTX['경부선 KTX']['2012':'2014'] #index의 범위를 지정하면 원하는 구간의 값을 얻을 수 있다.

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [91]:
df_KTX['호남선 KTX'][2:5]   #index의 위치로도 범위를 지정할 수 있음.  2:5로 지정했기에 2번 3번 4번 데이터가 출력됨

2013    6873
2014    6626
2015    8675
Name: 호남선 KTX, dtype: int64

In [92]:
df_KTX.loc['2016']['호남선 KTX']    #index column 을 지정해 하나의 원소만 뽑아낼 수 있음

10622.0

In [93]:
df_KTX.loc['2016','호남선 KTX']     #굳이 괄호를 두개 만들지 않고 쉼표를 통한 구분이 가능

10622

In [94]:
df_KTX['호남선 KTX'][5]

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_67522/823467365.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df_KTX['호남선 KTX'][5]

10622

In [95]:
df_KTX.T    #.T를 붙여 데이터의 전치를 구할 수 있다.

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [96]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [97]:
df_KTX[['동해선 KTX', '전라선 KTX', '경전선 KTX', '호남선 KTX', '경부선 KTX']] #열의 항목을 지정해 열의 순서를 지정할 수 있다.

      동해선 KTX  전라선 KTX  경전선 KTX  호남선 KTX  경부선 KTX
2011      NaN      309     3627     7313    39060
2012      NaN     1771     4168     6967    39896
2013      NaN     1954     4088     6873    42005
2014      NaN     2244     4424     6626    43621
2015   2395.0     3146     4606     8675    41702
2016   3786.0     3945     4984    10622    41266
2017   6667.0     5766     5570     9228    32427

### 데이터 통합하기

#### 세로 방향으로 통합하기

In [98]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [99]:
df2 = pd.DataFrame({'Class1': [87, 89],
                    'Class2': [85, 90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [100]:
df1._append(df2)    #index를 그대로 가져온다. append는 세로로 값이 합쳐진다.

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [101]:
df1._append(df2, ignore_index=True) #순차적으로 index를 증가하기 위해서 ignore_index=True를 입력한다.

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [102]:
df3 = pd.DataFrame({'Class1':[96,83]})

In [103]:
df2._append(df3, ignore_index=True) #데이터가 없는 부분은 NaN값으로 채워지게 됨.

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [104]:
df4 = pd.DataFrame({'Class3': [93,91,95,98]})
df4

   Class3
0      93
1      91
2      95
3      98

#### 가로 방향으로 통합하기

In [105]:
df1.join(df4)   #같은 index를 가지면 join을 써서 같은 index끼리는 붙어 출력된다.

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [106]:
df5 = pd.DataFrame({'Class4':[82,92]})
df5

   Class4
0      82
1      92

In [107]:
df1.join(df5)   #index기준으로 붙지만 데이터에서 원소가 없는 부분은 NaN으로 채워지게 된다.

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

In [108]:
#새로운 KTX추가해서 넣어보기
NewKTX = pd.DataFrame({'서해선 KTX' : [7373, 6947, 2314, 6666, 8765, 10222, 3224]}, index = index_list)
df_KTX.join(NewKTX)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX  서해선 KTX
2011    39060     7313     3627      309      NaN     7373
2012    39896     6967     4168     1771      NaN     6947
2013    42005     6873     4088     1954      NaN     2314
2014    43621     6626     4424     2244      NaN     6666
2015    41702     8675     4606     3146   2395.0     8765
2016    41266    10622     4984     3945   3786.0    10222
2017    32427     9228     5570     5766   6667.0     3224

### 특정 열을 기준으로 통합하기

In [109]:
df_A_B = pd.DataFrame({'판매월' : ['1월', '2월', '3월', '4월'],
                       '제품A' : [100, 150, 200, 130],
                       '제품B' : [90, 110, 140, 170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [110]:
df_C_D = pd.DataFrame({'판매월' : ['1월', '2월', '3월', '4월'],
                       '제품C' : [112, 141, 203, 134],
                       '제품D' : [90, 110, 140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [111]:
df_A_B.merge(df_C_D)    #판매월을 기준으로 merge가 됨을 확인할 수 있다.

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [112]:
df_left = pd.DataFrame({'key':['A', 'B', 'C'], 'left' : [1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [113]:
df_rigth = pd.DataFrame({'key' : ['A', 'B', 'D'], 'right' : [4,5,6]})
df_rigth

  key  right
0   A      4
1   B      5
2   D      6

In [114]:
df_left.merge(df_rigth, how ='left', on = 'key')    #left기준으로 D값이 없으니 출력이 되지 않고 right 기준으로는 C값이 없으니 NaN이 출력된다.

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [115]:
df_left.merge(df_rigth, how='right', on='key')      #how를 rigth를 입력하여 C대신 D가 출력됨을 확인할 수 있다.

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [116]:
df_left.merge(df_rigth, how='outer', on='key')      #outer는 A, B, C, D 모두 출력이 된다.

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [117]:
df_left.merge(df_rigth, how='inner', on='key')      #두개의 데이터에 모두 포함된 A,B 만 출력이 된다.

  key  left  right
0   A     1      4
1   B     2      5

### 데이터 파일을 읽고 쓰기

In [118]:
%%writefile sea_rain1.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Overwriting sea_rain1.csv

In [119]:
pd.read_csv('sea_rain1.csv', encoding='UTF8')   #한글을 제대로 읽어올 수 있게 utf8로 인코딩을 하자

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [120]:
%%writefile sea_rain1_space.txt
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Overwriting sea_rain1_space.txt

read_csv()에서 읽고자 하는 데이터 파일의 구분자가 콤마가 아닌 경우에는 'sep=구분자'로 추가해야 텍스트파일에서 DataFrame형식으로 읽어올 수 있다.

In [121]:
pd.read_csv('sea_rain1_space.txt', sep=' ') #txt파일도 read_csv를 통해 DataFrame으로 읽어올 수 있다.

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [122]:
pd.read_csv('sea_rain1.csv', index_col="연도")  #index_col을 사용하여 자동으로 생성된 index 대신 index_col로 지정한 '연도'를 index로 변경할 수 있다.

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [123]:
df_WH = pd.DataFrame({'Weight' : [62, 67, 55, 74],
                      'Heigth' : [165, 177, 160, 180]},
                      index = ['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name= 'User'
df_WH

      Weight  Heigth
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [124]:
bmi = df_WH['Weight'] / (df_WH['Heigth'] / 100) ** 2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [125]:
df_WH['BMI'] = bmi  #BMI라는 column 을 만들고 그안에 bmi데이터 지정
df_WH

      Weight  Heigth        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [126]:
df_WH.to_csv('save_DataFrame.csv')      #csv파일로 저장

In [127]:
df_pr = pd.DataFrame({'판매가격' : [2000, 3000, 5000, 10000],
                      '판매량' : [32, 53, 40, 25],},
                      index = ['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [128]:
file_name = 'save_DataFrame_cp949.txt'  
df_pr.to_csv(file_name, sep=' ', encoding="UTF8")   #입력한 df_pr을 txt파일로 저장

### Series

In [129]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index = ['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [130]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [131]:
s.name = '인구'         #Series의 이름을 '인구' 로 설정
s.index.name = '도시'   #index의 이름 을 '도시'로 설정
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

#### Series의 연산
시리즈는 백터화 연산이 가능 <br/>
연산은 시리즈 값에만 적용할 수 있고 인덱스 값은 변하지 않음

In [132]:
s / 1000000     #값이 float형으로 변경

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

#### Series의 인덱싱
인덱스 라벨을 이용한 인덱싱,배열 인덱싱이나 인덱스 라벨을 이용한 인덱싱도 가능하다.

In [133]:
s[2], s["부산"] #index의 위치나 값을 입력해 가져올 수 있다.

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_67522/137308793.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[2], s["부산"] #index의 위치나 값을 입력해 가져올 수 있다.

(2890451, 3448737)

In [134]:
#자료 순서 바꾸기
s[[0,3,1]]      #자료를 뽑아 가져오는걸 이용해 순서를 바꾸는게 가능하다.

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_67522/3602723791.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[0,3,1]]      #자료를 뽑아 가져오는걸 이용해 순서를 바꾸는게 가능하다.

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [135]:
s[(250e4 < s) & (s < 500e4)]        #인구가 250만 이상 500만 미만인 경우를 뽑아올 수 있다.

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [136]:
s[['부산','인천']]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [137]:
s0 = pd.Series(range(3), index=['a', 'b', 'c'])
s0

a    0
b    1
c    2
dtype: int64

In [138]:
s0.a

0


### 시리즈와 딕셔너리 자료형
딕셔너리 자료형에서 제공하는 in 연산, for 루프를 통한 key와 value에 접근이 가능하다

In [139]:
'서울' in s #index 라벨 중에 서울의 유무

True

In [140]:
'대전' in s #대전이 없기에 False가 출력

False

In [141]:
# for 문을 통하여 key값과 value값을 추출
for keys, values in s.items() :
    print('key = {0}  value = {1}'.format(keys, values))

key = 서울  value = 9904312
key = 부산  value = 3448737
key = 인천  value = 2890451
key = 대구  value = 2466052

In [142]:
s2 = pd.Series({"서울" : 9631482, "부산" : 3393191,
                "인천" : 2632035, "대전" : 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [143]:
s2[1]

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_67522/2825080482.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[1]

3393191

딕셔너리형태는 순서를 보장하지 않는다. 만약 순서를 정하고 싶다면 인덱스를 리스트로 지정해야 한다

In [144]:
s2 = pd.Series({"서울" : 9631482, "부산" : 3393191,
                "인천" : 2632035, "대전" : 1490158},
                index=["부산", "서울", "인천", "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [145]:
#인덱스가 같은 데이터에 대해서만 연산이 가능
ds = s -s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [146]:
#null 값이 아닌 것 찾기
ds.notnull()    #값이 없는 NaN값이면 False출력

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [147]:
ds[ds.notnull()]    #notnull()에서 True인 값만 추출

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [148]:
#증가율 계산
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
print(rs)

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

#### 데이터 인덱싱

In [149]:
rs["부산"] = 1.63   #값을 지정해서 변경가능
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [150]:
rs["대구"] = 1.41   #값을 집어넣어주면 없던 값이 데이터프레임에 추가된다.
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [151]:
del rs["대구"]
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

## DataFame

In [152]:
values = [[1,2,3], [4,5,6], [7,8,9]]
index = ['one', 'two', 'three']
columns = ['A', 'B', 'C']

df = pd.DataFrame(values, index= index, columns= columns)

print('데이터프레임 출력 :')
print('-'*18)
print(df)

데이터프레임 출력 :
------------------
       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

In [153]:
df1 = pd.DataFrame(values, columns=columns)
print(df1)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [154]:
# 리스트로 생성하기
data = [
    ['1000', 'Steve', 90.72], 
    ['1001', 'James', 78.09], 
    ['1002', 'Doyeon', 98.43], 
    ['1003', 'Jane', 64.19], 
    ['1004', 'Pilwoong', 81.30],
    ['1005', 'Tony', 99.14],
]
df = pd.DataFrame(data)
print(df)

      0         1      2
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [155]:
type(df)

pandas.core.frame.DataFrame

In [156]:
df = pd.DataFrame(data, columns=['학번', '이름', '점수'])
print(df)

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [157]:
#딕셔너리로 생성하기
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [158]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100   #값이 없으면 추가 있다면 update가 된다.
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [159]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(3)
df

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83         -1.343
부산  경상권  3448737  3393191  3512547  3655437           1.63         -3.398
인천  수도권  2890451  2632035  2517680  2466338           9.82          4.542
대구  경상권  2466052  2431774  2456016  2473990           1.41         -0.987

In [160]:
del df["2010-2015 증가율"]
df

     지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972         -1.343
부산  경상권  3448737  3393191  3512547  3655437         -3.398
인천  수도권  2890451  2632035  2517680  2466338          4.542
대구  경상권  2466052  2431774  2456016  2473990         -0.987

#### 열 인덱싱

In [161]:
#하나의 열만 인덱싱하면 시리즈가 반환된다.
df["지역"]

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [162]:
#여러개의 열을 인덱싱하면 부분적인 데이터프레임이 반환된다.
df[["2010", "2015"]]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [163]:
#2하나의 열을 반환하면서 데이터프레임 자료형을 유지하는 방법
df[["지역"]]
#괄호가 하나면 시리즈 두개를 사용하면 데이터프레임으로 출력

     지역
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [164]:
#문자열 라벨을 가지는 경우 정수 인덱스를 열 인덱싱에 사용할 수 없음
df[0]

KeyError: 0

In [ ]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

## csv 불러오기 및 작성

In [ ]:
df = pd.read_csv('RegularSeasonCompactResults.csv')
df

        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0         1985      20     1228      81     1328      64    N      0
1         1985      25     1106      77     1354      70    H      0
2         1985      25     1112      63     1223      56    H      0
3         1985      25     1165      70     1432      54    H      0
4         1985      25     1192      86     1447      74    H      0
...        ...     ...      ...     ...      ...     ...  ...    ...
156084    2018     132     1153      56     1222      55    N      0
156085    2018     132     1172      58     1348      57    N      0
156086    2018     132     1209      74     1426      61    N      0
156087    2018     132     1246      77     1397      72    N      0
156088    2018     132     1335      68     1217      65    N      0

[156089 rows x 8 columns]

In [ ]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three  #sample1.csv 작성

Writing sample1.csv

In [ ]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [ ]:
pd.read_csv('sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [ ]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [ ]:
pd.read_csv('sample4.txt', skiprows=[0,1,4])    #지정한 row값을 스킵한다.

   c1    c2      c3
0   1  1.11     one
1   3  3.33   three

In [ ]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing sample5.csv

In [ ]:
df = pd.read_csv('sample5.csv', na_values=['누락']) #na_values[' '] 따옴표 안에 있는 값들을 NaN으로 표시하고 싶으면.
df

    c1     c2      c3
0  1.0   1.11     one
1  2.0            two
2  NaN   3.33   three

In [ ]:
df = pd.read_csv('sample5.csv', na_values=['누락', ' '])    #데이터 처리를 하기위해 공백으로 통일하거나 NaN으로 통일해야 데이터의 가공이 용이하다.
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

데이터프레임 값을 csv파일로 출력하고 싶으면 to_csv메서드를 사용

In [ ]:
df.to_csv('sample6.csv')

read_csv명령을 사용 시 파일의 경로 대신 URL을 지정하면 pandas가 직접 해당 파일을 다운로드하여 읽게된다.

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [ ]:
df.info()       #info 로 데이터의 전체적인 정보를 획득할 수 있다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
pd.set_option("display.max_rows",20)    #앞뒤로 모두 20행만 보여준다.
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 데이터프레임 고급 인덱싱
loc, iloc

In [ ]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
                  index = ["a", "b", "c"],
                  columns = ['A', 'B', 'C', 'D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [ ]:
df.loc["a"] #index a 의 값을 Series로 출력

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [ ]:
# loc를 쓰지 않는 경우와 같다.  다시한번 한개가 아니라면 데이터프레임형태로 출력
df["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [ ]:
df.A > 15   # A의 열에 존재하는 값이 15보다 큰지 출력

a    False
b    False
c     True
Name: A, dtype: bool

In [ ]:
df.loc[df.A > 15]   #loc에 넣게되면 True의 값만 출력이 된다. 
# A가 15보다 큰 row값을 출력한다.

    A   B   C   D
c  18  19  20  21

In [ ]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4,4), columns = ['A', 'B', 'C', 'D'])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [ ]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [ ]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [ ]:
df.loc['a', 'A']

10

In [ ]:
df.loc['b':, 'A']

b    14
c    18
Name: A, dtype: int64

In [ ]:
df.loc['a', :]

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [ ]:
df.loc[['a','b'], ['B','D']]

    B   D
a  11  13
b  15  17

In [ ]:
df.loc[df.A > 10]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [ ]:
df.loc[df.A > 10, ["C","D"]]    #조건에 만족한 결과중에 column C와 D만도 출력이 가능하다.

    C   D
b  16  17
c  20  21

In [ ]:
#iloc는 정수만 받는다?
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [ ]:
df.iloc[0,1]

11

In [ ]:
df.iloc[:2,2]

a    12
b    16
Name: C, dtype: int64

In [ ]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int64